ErnestCho/ccs_workspace_v12_msp_projects/msp430fr2676PTT_touch_timer_game/main_touch_timer_game_fr2676.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
// Development main.c for MSP430FR2676 CapTIvate devices.
//
// This starter application initializes the CapTIvate touch library
// for the touch panel specified by CAPT_UserConfig.c/.h via a call to
// CAPT_appStart(), which initializes and calibrates all sensors in the
// application, and starts the CapTIvate interval timer.
//
// Then, the capacitive touch interface is driven by calling the CapTIvate
// application handler, CAPT_appHandler().  The application handler manages
// whether the user interface (UI) is running in full active scan mode, or
// in a low-power wake-on-proximity mode.
//
// \version 1.83.00.05
// Released on May 15, 2020
//
//*****************************************************************************

#include <msp430.h>                      // Generic MSP430 Device Include
#include "driverlib.h"                   // MSPWare Driver Library
#include "captivate.h"                   // CapTIvate Touch Software Library
#include "CAPT_App.h"                    // CapTIvate Application Code
#include "CAPT_BSP.h"                    // CapTIvate EVM Board Support Package

#include "common.h"
#include "stdint.h"
#include "ssd1306.h"
#include "lp5012.h"
#include "string.h"


#define DISABLE     0
#define ENABLE      1

void GPIO_I2C_Init(void)
{
    // LP5012
    SCL_1;
    SDA_1;
    SCL_OUT;
    SDA_OUT;
    SCL_PU;
    SDA_PU;
}

#if 0       // EN pin is hard wired pulled up
void GPIO_LP5012_IC_enable(unsigned char en)
{
    LP5012_EN_DIR_OUTPUT;

    if(en == 1)
        LP5012_EN_PIN_HIGH;
    else
        LP5012_EN_PIN_LOW;
    delay_ms(10);
}
#endif

void FR2676_LP5012_board_init()
{
    LP5012_I2C_chip_reset_1(1);
    delay_ms(100);

    LP5012_I2C_chip_enable_1(ENABLE);

    delay_ms(100);

}


//
// Timer related
//
#define LIMIT_MILI_SEC      1000
#define LIMIT_SECOND        60
#define LIMIT_MINUTE        60

typedef struct tag_timer_type
{
    unsigned short msec;
    unsigned char sec;
    unsigned char min;
    unsigned char hour;
}_tag_timer_type;

_tag_timer_type timer =
{
    .msec = 0,
    .sec = 0,
    .min = 0,
    .hour = 0
};
long timer_comparison = 0;
_tag_timer_type record_timer =
{
    .msec = 0,
    .sec = 0,
    .min = 0,
    .hour = 0
};
long record_timer_comparison = 0;
_tag_timer_type previous_timer =
{
    .msec = 0,
    .sec = 0,
    .min = 0,
    .hour = 0
};

uint8_t new_record_flag = 0;

//
// Periodic timer (TA0 source = SMCLK/4 = 2M/4 = 500kHz)
//
#define TIMER0_SMCLK_1msec              500
#define TIMER0_SMCLK_5msec              2500
#define TIMER0_SMCLK_10msec             5000
#define TIMER0_SMCLK_100msec            50000

#define CONST_TIMER0_CCR0               TIMER0_SMCLK_1msec
#define CONST_TIMER0_CCR1               TIMER0_SMCLK_5msec
#define CONST_TIMER0_CCR2               TIMER0_SMCLK_10msec

// 1msec,  5msec, 10msec continuous timer
void timerA0_init(void)
{
    TA0CTL = TASSEL_2 + MC_2;                   // SMCLK, Cont. mode
    // CCR0 interrupt enabled : 10msec
    TA0CCTL0 = CCIE;
    TA0CCR0 = CONST_TIMER0_CCR0;
    // CCR1 interrupt enabled : 100msec
//    TA0CCTL1 = CCIE;
//    TA0CCR1 = CONST_TIMER0_CCR1;
    // CCR2 interrupt enabled : 200msec
//    TA0CCTL2 = CCIE;
//    TA0CCR2 = CONST_TIMER0_CCR2;
}

void timerA0_start(void)
{
    timer.hour = timer.min = timer.sec = timer.msec = 0;

    TA0CTL = TASSEL_2 + MC_2 + + ID_2 + TACLR;                   // SMCLK, DIV4, up mode
    // CCR0 interrupt enabled
    TA0CCTL0 = CCIE;
    TA0CCR0 = CONST_TIMER0_CCR0;

}

void timerA0_stop(void)
{
    TA0CTL = TASSEL_2 + MC_0;
    // CCR0 interrupt enabled
    TA0CCTL0 = 0;
    TA0CCR0 = 0;

}



//
// switch related
//
uint8_t switch_status = 0;

// SW1 = P1.6
#define SW1_PORT_DIR            P1DIR
#define SW1_PORT_OUT            P1OUT
#define SW1_PORT_REN            P1REN
#define SW1_PORT_IES            P1IES
#define SW1_PORT_IE             P1IE
#define SW1_PORT_IFG            P1IFG
#define SW1_BIT                 BIT6

// SW2 = P2.7
#define SW2_PORT_DIR            P2DIR
#define SW2_PORT_OUT            P2OUT
#define SW2_PORT_REN            P2REN
#define SW2_PORT_IES            P2IES
#define SW2_PORT_IE             P2IE
#define SW2_PORT_IFG            P2IFG
#define SW2_BIT                 BIT7

///////////////////////////////////////////////////////////////////////
// GPIO Switch interrupt part
///////////////////////////////////////////////////////////////////////

// GPIO_P1InterruptSet() : external interrupt setup for P1
// param : bits - multi-bits setup
void GPIO_SW1_SW2_Interrupt_Set(void)
{
    SW1_PORT_DIR &= ~SW1_BIT;                         // port as Input
    SW1_PORT_OUT |= SW1_BIT;                          // Configure P1 as pulled-up
    SW1_PORT_REN |= SW1_BIT;                          // P1 pull-up register enable
    SW1_PORT_IES &= ~SW1_BIT;                         // P1 edge, 0: low to high edge
    SW1_PORT_IE  |= SW1_BIT;                          // P1 interrupt enabled
    SW1_PORT_IFG &= ~SW1_BIT;                         // P1 IFG cleared

    SW2_PORT_DIR &= ~SW2_BIT;
    SW2_PORT_OUT |= SW2_BIT;                          // Configure P2.x as pulled-up
    SW2_PORT_REN |= SW2_BIT;                          // P2.x pull-up register enable
    SW2_PORT_IES &= ~SW2_BIT;                         // P2.x edge, 0: low to high edge
    SW2_PORT_IE  |= SW2_BIT;                          // P2.x interrupt enabled
    SW2_PORT_IFG &= ~SW2_BIT;                         // P2.x IFG cleared
}



typedef struct touch_bit_type {
    unsigned btn0_touch_on : 1;
    unsigned btn0_key_on : 1;
    unsigned btn1_touch_on : 1;
    unsigned btn1_key_on : 1;
    unsigned btn2_touch_on : 1;
    unsigned btn2_key_on : 1;
    unsigned change_occur : 1;
}_tag_touch_bit_type;

_tag_touch_bit_type touch_info = {
    .btn0_touch_on = 0,
    .btn0_key_on = 0,
    .btn1_touch_on = 0,
    .btn1_key_on = 0,
    .btn2_touch_on = 0,
    .btn2_key_on = 0,
    .change_occur = 0,
};

void touch_info_init(void)
{
    touch_info.btn0_touch_on = 0;
    touch_info.btn0_key_on = 0;
    touch_info.btn1_touch_on = 0;
    touch_info.btn1_key_on = 0;
    touch_info.btn2_touch_on = 0;
    touch_info.btn2_key_on = 0;
    touch_info.change_occur = 0;

