ErnestCho/ccs_workspace_v12_msp_projects/msp430fr2676PTT_touch_timer_game/main_touch_timer_game_fr2676.c
}

#define TOUCH_PRESS_DETECT      1
#define TOUCH_RELEASE_DETECT    2

#define TOUCH_DETECT   TOUCH_RELEASE_DETECT

extern tElement BTN00_E00;
extern tElement BTN00_E01;
extern tElement BTN00_E02;

// make faster touch detection response
void fasterButtonEventHandler(tSensor *pSensor)
{
    // bTouch is set to 1 when it pressed
    // ==> bDetect is faster than bTouch when pressed, bTouch is faster than bDetect when released
    // so we would like to make a flag(button_touch when it turned released
    // check BTN00_E00 button
    if (BTN00_E00.bDetect == 1)
    {
        if(touch_info.btn0_touch_on == 0)    // set bit one time
        {
            touch_info.btn0_touch_on = 1;

            touch_info.change_occur = 1;        // update needed at main loop
            touch_info.btn0_key_on = 1;     // user use this variable
        }
        else
        {
            __no_operation();
        }

        if(touch_info.change_occur == 0)    // if touch detection captured from main?
        {
            touch_info.btn0_key_on = 0;
        }
    }
    else
    {
        if(touch_info.btn0_touch_on == 1)        // normal case of touch
        {
            touch_info.btn0_touch_on = 0;

            touch_info.change_occur = 1;        // update needed at main loop
            touch_info.btn0_key_on = 0;
        }
    }

    if (BTN00_E01.bDetect == 1)
    {
        if(touch_info.btn1_touch_on == 0)    // set bit one time
        {
            touch_info.btn1_touch_on = 1;

            touch_info.change_occur = 1;        // update needed at main loop
            touch_info.btn1_key_on = 1;     // user use this variable
        }
        else
        {
            __no_operation();
        }

        if(touch_info.change_occur == 0)    // if touch detection captured from main?
        {
            touch_info.btn1_key_on = 0;
        }
    }
    else
    {
        if(touch_info.btn1_touch_on == 1)        // normal case of touch
        {
            touch_info.btn1_touch_on = 0;

            touch_info.change_occur = 1;        // update needed at main loop
            touch_info.btn1_key_on = 0;
        }
    }

    if (BTN00_E02.bDetect == 1)
    {
        if(touch_info.btn2_touch_on == 0)    // set bit one time
        {
            touch_info.btn2_touch_on = 1;

            touch_info.change_occur = 1;        // update needed at main loop
            touch_info.btn2_key_on = 1;     // user use this variable
        }
        else
        {
            __no_operation();
        }

        if(touch_info.change_occur == 0)    // if touch detection captured from main?
        {
            touch_info.btn2_key_on = 0;
        }
    }
    else
    {
        if(touch_info.btn2_touch_on == 1)        // normal case of touch
        {
            touch_info.btn2_touch_on = 0;

            touch_info.change_occur = 1;        // update needed at main loop
            touch_info.btn2_key_on = 0;
        }
    }

}

void ButtonEventHandler(tSensor *pSensor)
{
    // bTouch is set to 1 when it pressed
    // so we would like to make a flag(button_touch when it turned released
    // check BTN00_E00 button
    if (BTN00_E00.bTouch == 1)
    {
        if(touch_info.btn0_touch_on == 0)    // set bit one time
        {
            touch_info.btn0_touch_on = 1;
        }
#if (TOUCH_DETECT == TOUCH_PRESS_DETECT)
            touch_info.change_occur = 1;        // update needed at main loop
            if(touch_info.btn0_key_on == 1)      // (key_on == 1) : button touched and released
                touch_info.btn0_key_on = 0;
            else
                touch_info.btn0_key_on = 1;
        }
#endif
    }
    else
    {
        if(touch_info.btn0_touch_on == 1)        // normal case of touch
        {
            touch_info.btn0_touch_on = 0;
#if (TOUCH_DETECT == TOUCH_RELEASE_DETECT)
            touch_info.change_occur = 1;        // update needed at main loop
            if(touch_info.btn0_key_on == 1)      // (key_on == 1) : button touched and released
                touch_info.btn0_key_on = 0;
            else
                touch_info.btn0_key_on = 1;
        }
#endif
    }
    // check BTN00_E01 button
    if (BTN00_E01.bTouch == 1)
    {
        if(touch_info.btn1_touch_on == 0)    // set bit one time
        {
            touch_info.btn1_touch_on = 1;
        }
#if (TOUCH_DETECT == TOUCH_PRESS_DETECT)
            touch_info.change_occur = 1;        // update needed at main loop
            if(touch_info.btn1_key_on == 1)      // (key_on == 1) : button touched and released
                touch_info.btn1_key_on = 0;
            else
                touch_info.btn1_key_on = 1;
        }
#endif
    }
    else
    {
        if(touch_info.btn1_touch_on == 1)        // normal case of touch
        {
            touch_info.btn1_touch_on = 0;
#if (TOUCH_DETECT == TOUCH_RELEASE_DETECT)
            touch_info.change_occur = 1;        // update needed at main loop
            if(touch_info.btn1_key_on == 1)      // (key_on == 1) : button touched and released
                touch_info.btn1_key_on = 0;
            else
                touch_info.btn1_key_on = 1;
        }
#endif

    }
}


#define NUM_OF_LP5012_DEV   1
#define MAX_LED             12
#define LED_OUT_X_MID_LEVEL         0x20
#define LED_OUT_X_HIGH_LEVEL        0x60

uint8_t toggle = 0;
uint8_t brightness_level = 128;       // level : 0~255
uint8_t brightness = 2, led_ch = 0;
uint8_t data_buf[0x16];
uint8_t i, data;

char disp_buf[24];
char tmp_buf[6];

// TOUCH_TOUCH_RUN :
// - Right btn :

typedef enum
{
     //GAME_MODE_NONE = 0,
     GAME_MODE_TOUCH_TOUCH_RUN = 0,
     GAME_MODE_STOP_WATCH,
     GAME_MODE_MAX
}enum_game_mode;
enum_game_mode game_mode = GAME_MODE_TOUCH_TOUCH_RUN;

#define GAME_DEFAULT_REPEAT     4
uint8_t game_repeat_cnt = GAME_DEFAULT_REPEAT;
uint8_t game_repeat_cnt_backup = GAME_DEFAULT_REPEAT;

typedef enum
{
    GAME_SETTING = 0,
    GAME_EXECUTING = 1,
    GAME_DISP_RESULT = 2,
    GAME_WAIT_NEXT_STEP = 3,
}enum_game_status;
enum_game_status game_status = GAME_SETTING;

//#define CONST   //const

CONST char str_mode[] = "game";               //5 : including null
CONST char str_switch_info1[] = "game       count";    //17 : including null
CONST char str_switch_info2[] = "game     execute";    //17 : including null
CONST char str_main_dp1[] = "Touch Timer ";            //12 : including null
CONST char str_main_dp2[] = "    running!";           //13 : including null
CONST char str_main_dp3[] = "Want to run?";           //13 : including null

CONST char str_game_mode[]  = "Select Game:";          // 12 : including null
CONST char str_game[] = "Game :";                     // 7 : including null
CONST char str_game_mode0[] = "1.Touch&Run";          // 12 : including null
CONST char str_game_mode1[] = "2.Stop watch";           // 11 : including null
CONST char str_game_cnt[] = "Game Cnt:";            // 12 : including null
CONST char str_push_execute[] = "Push Execute";           // 13 : including null

CONST char str_stop_stop[] = "stop        stop";        // 17
CONST char str_executing[] = "Executing";                  // 10
CONST char str_more[] = " more..";
CONST char str_result[] = "::Results::";                  // 10
CONST char str_new_record[] = "New Record!";                  // 10
CONST char str_top[] = "Top:";                  // 10
CONST char str_now[] = "Now:";                  // 10
CONST char str_previous[] = "Prv:";                  // 10

