ErnestCho/ccs_workspace_v12_msp_projects/msp430fr2676PTT_touch_timer_game/main_touch_timer_game_fr2676.c
CONST char str_touch_to_start[] = "touch to start";          // 14 : including null
CONST char str_touch_to_stop[] = "touch & stop";          // 14 : including null


void main(void)
{
	//
	// Initialize the MCU
	// BSP_configureMCU() sets up the device IO and clocking
	// The global interrupt enable is set to allow peripherals
	// to wake the MCU.
	//
	WDTCTL = WDTPW | WDTHOLD;
	BSP_configureMCU();             // need to initialize/modify by HW pin map.


    GPIO_SW1_SW2_Interrupt_Set();
    // Disable the GPIO power-on default high-impedance mode
    // to activate previously configured port settings
     PM5CTL0 &= ~LOCKLPM5;
    __delay_cycles(10000);

    // OLED initialization
    i2c_init();                                 // initialize I2C to use with OLED

    ssd1306_init();                             // Initialize SSD1306 OLED
    ssd1306_clearDisplay();                     // Clear OLED display
    delay_ms(1);


	__bis_SR_register(GIE);

    //
    // Register button call back function
    //
//    MAP_CAPT_registerCallback(&BTN00, &ButtonEventHandler);
    MAP_CAPT_registerCallback(&BTN00, &fasterButtonEventHandler);

	//
	// Start the CapTIvate application
	//
	CAPT_appStart();


    //GPIO_LP5012_IC_enable(1);             // EN pin is hard wired pulled up at this solution
    GPIO_I2C_Init();
    FR2676_LP5012_board_init();

    //i2c_write_byte(LP5012_DEV0_ADDR, LP5012_DEVICE_CONFIG1, BIT5);       // set config1 register
    //[to save mem]i2c_write_byte(LP5012_DEV0_ADDR, LP5012_DEVICE_CONFIG1, 0x00);       // set config1 register
    i2c_write_byte_1(LP5012_DEVICE_CONFIG1, 0x00);
    //LP5012_I2C_chip_enable(LP5012_DEV0_ADDR, 1);

    //
    // LED animation of shifting LED
    //
    //brightness_level = 128;         // brightness :
    //LP5012_I2C_LEDx_ch_brightness(LP5012_DEV0_ADDR, brightness_level, brightness_level, brightness_level, brightness_level);
    LP5012_I2C_LEDx_single_brightness_1(brightness_level);

    // seperate color control
    for(led_ch=0; led_ch<MAX_LED; led_ch++)
    {
        LP5012_I2C_OUTx_color_1(led_ch, LED_OUT_X_MID_LEVEL);      // color level set from 0x80 to 0xc0
        delay_ms(25);
    }
    for(led_ch=0; led_ch<MAX_LED; led_ch++)
    {
        LP5012_I2C_OUTx_color_1(led_ch, 0x00);      // color level set from 0x80 to 0xc0
        delay_ms(25);
    }


    MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
    ssd1306_clearDisplay();
    ssd1306_printString(0, 0, str_mode, FONT_6x8);
    ssd1306_printString(0, 1, str_main_dp1, FONT_MS_GOTHIC8x16);
    ssd1306_printString(0, 3, str_main_dp2, FONT_MS_GOTHIC8x16);
    ssd1306_printString(0, 5, str_main_dp3, FONT_MS_GOTHIC8x16);
    ssd1306_printString(0, 7, str_touch_to_start, FONT_6x8);
    MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)

	//
	// Background Loop
	//
	while(1)
	{
        if(game_status == GAME_SETTING)
        {
            // Run the captivate application handler.
            CAPT_appHandler();

            ///////////////////////////////////////////////////
            // check switch buttons are pressed : SW1
            ///////////////////////////////////////////////////
            if(switch_status & BIT0) // switch1 function : Mode change
            {
                switch_status &= ~BIT0;

                game_mode++;
                if(game_mode >= GAME_MODE_MAX)
                {
                    game_mode = GAME_MODE_TOUCH_TOUCH_RUN;
                }

                MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
                ssd1306_clearDisplay();
                ssd1306_printString(0, 1, str_game_mode, FONT_MS_GOTHIC8x16);

                switch(game_mode)
                {
                    case GAME_MODE_TOUCH_TOUCH_RUN :
                    {
                        ssd1306_printString(0, 0, str_switch_info1, FONT_6x8);
                        ssd1306_printString(0, 3, str_game_mode0, FONT_MS_GOTHIC8x16);
                        ssd1306_printString(0, 7, str_touch_to_start, FONT_6x8);
                    }break;
                    case GAME_MODE_STOP_WATCH :
                    {
                        ssd1306_printString(0, 0, str_mode, FONT_6x8);
                        ssd1306_printString(0, 3, str_game_mode1, FONT_MS_GOTHIC8x16);
                        ssd1306_printString(0, 7, str_touch_to_start, FONT_6x8);
                    }break;
                }
                MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
            }

            /////////////////////////////////////////////////
            // check switch buttons are pressed : SW2
            /////////////////////////////////////////////////
            if(switch_status & BIT1)    // switch2 function : Mode parameter setting
            {
                switch_status &= ~BIT1;

                if(game_mode == GAME_MODE_TOUCH_TOUCH_RUN)
                {
                    game_repeat_cnt++;              // increase game repeat counts(touch counts).
                    if(game_repeat_cnt > 12)
                    {
                        game_repeat_cnt = 0;
                    }
                    game_repeat_cnt_backup = game_repeat_cnt;

                    MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
                    ssd1306_clearDisplay();
                    ssd1306_printString(0, 0, str_switch_info1, FONT_6x8);
                    ssd1306_printString(0, 1, str_game, FONT_MS_GOTHIC8x16);
                    ssd1306_printString(0, 3, str_game_mode0, FONT_MS_GOTHIC8x16);

                    memset(disp_buf, 0, 24);
                    strcpy(disp_buf, str_game_cnt);
#ifdef CCS_VER9
                    ltoa(game_repeat_cnt, tmp_buf);
#else
                    ltoa(game_repeat_cnt, tmp_buf, 10);
#endif
                    strcat(disp_buf, tmp_buf);
                    strcat(disp_buf, " ");

                    ssd1306_printString(0, 5, disp_buf, FONT_MS_GOTHIC8x16);
                    MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)

