ErnestCho/ccs_workspace_v12_msp_projects/msp430fr2676PTT_touch_timer_game/main_touch_timer_game_fr2676.c
                }
                else if(game_mode == GAME_MODE_STOP_WATCH)
                {
                    MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
                    ssd1306_clearDisplay();
                    ssd1306_printString(0, 0, str_mode, FONT_6x8);
                    ssd1306_printString(0, 1, str_game, FONT_MS_GOTHIC8x16);
                    ssd1306_printString(0, 3, str_game_mode1, FONT_MS_GOTHIC8x16);

                    ssd1306_printString(0, 5, str_push_execute, FONT_MS_GOTHIC8x16);
                    MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
                }
            }

            /////////////////////////////////////////////////
            // LED indication
            /////////////////////////////////////////////////
            if(game_mode == GAME_MODE_TOUCH_TOUCH_RUN)
            {
                if(game_repeat_cnt == 0)
                {
                    // clear all leds
                    for(led_ch=0; led_ch<MAX_LED; led_ch++)
                    {
                        LP5012_I2C_OUTx_color_1(led_ch, 0x00);      // color level set from 0x80 to 0xc0
                    }
                }
                else
                {
                    // separate color control
                    for(led_ch=0; led_ch<game_repeat_cnt; led_ch++)
                    {
                        LP5012_I2C_OUTx_color_1(led_ch, LED_OUT_X_MID_LEVEL);      // color level set from 0x80 to 0xc0
                    }
                }
            }
            else
            {
                // clear all leds
                for(led_ch=0; led_ch<MAX_LED; led_ch++)
                {
                    LP5012_I2C_OUTx_color_1(led_ch, 0x00);      // color level set from 0x80 to 0xc0
                }
                game_repeat_cnt = 1;
            }

            // start the game
            if(touch_info.change_occur == 1)
            {
                touch_info.change_occur = 0;
                if(touch_info.btn0_key_on == 1)   // touch pressed
                {
                    // start game running
                    game_status = GAME_EXECUTING;
                    timerA0_start();

#ifdef CCS_VER9
                    ltoa(game_repeat_cnt, tmp_buf);
#else
                    ltoa(game_repeat_cnt, tmp_buf, 10);
#endif
                    strcpy(disp_buf, tmp_buf);
                    strcat(disp_buf, str_more);

                    MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
                    ssd1306_clearDisplay();
                    ssd1306_printString(0, 0, str_stop_stop, FONT_6x8);
                    ssd1306_printString(0, 1, str_executing, FONT_MS_GOTHIC8x16);
                    //ssd1306_printString(0, 3, str_game_mode0, FONT_MS_GOTHIC8x16);
                    if(game_mode == GAME_MODE_TOUCH_TOUCH_RUN)
                    {
                        ssd1306_printString(0, 3, disp_buf, FONT_MS_GOTHIC8x16);
                    }
                    else
                    {
                        ssd1306_printString(0, 3, str_touch_to_stop, FONT_MS_GOTHIC8x16);
                    }

                    ssd1306_clear_one_line(5);
                    ssd1306_clear_one_line(6);
                    MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)

                }
            }
            //
            // End of background loop iteration
            // Go to sleep if there is nothing left to do
            //
            CAPT_appSleep();

        }   // end of if(game_status == GAME_SETTING)

        else if(game_status == GAME_EXECUTING)
        {
            //
            // Run the captivate application handler.
            //
            CAPT_appHandler();
#if 1   // runtime display of the time
#ifdef CCS_VER9
            ltoa(timer.min, tmp_buf);
#else
            ltoa(timer.min, tmp_buf, 10);
#endif
            strcpy(disp_buf, tmp_buf);
            strcat(disp_buf, ":");
#ifdef CCS_VER9
            ltoa(timer.sec, tmp_buf);
#else
            ltoa(timer.sec, tmp_buf, 10);
#endif
            strcat(disp_buf, tmp_buf);
            strcat(disp_buf, ":");
#ifdef CCS_VER9
            ltoa(timer.msec, tmp_buf);
#else
            ltoa(timer.msec, tmp_buf, 10);
#endif
            strcat(disp_buf, tmp_buf);
            strcat(disp_buf, "   ");
            MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
            ssd1306_printString(0, 5, disp_buf, FONT_MS_GOTHIC8x16);
            MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)


            if(game_mode == GAME_MODE_TOUCH_TOUCH_RUN)
            {
#ifdef CCS_VER9
                ltoa(game_repeat_cnt, tmp_buf);
#else
                ltoa(game_repeat_cnt, tmp_buf, 10);
#endif
                strcpy(disp_buf, tmp_buf);
                strcat(disp_buf, str_more);

                MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
                ssd1306_printString(0, 3, disp_buf, FONT_MS_GOTHIC8x16);
                MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
            }
#endif
            if(touch_info.change_occur == 1)
            {
                touch_info.change_occur = 0;

                if(touch_info.btn0_touch_on == 1)
                {
                    if(game_repeat_cnt == 1)    // check end of the game?
                    {
                        timerA0_stop();
                        game_repeat_cnt = 0;

                        // save results
                        game_status = GAME_DISP_RESULT;
                    }
                    else
                    {
                        game_repeat_cnt--;
                    }

                    //
                    LP5012_I2C_OUTx_color_1(game_repeat_cnt, 0);
                }
            }

            if(switch_status & BIT0 || switch_status & BIT1) // switch1 function : Mode change
            {
                game_status = GAME_WAIT_NEXT_STEP;
            }


            //
            // End of background loop iteration
            // Go to sleep if there is nothing left to do
            //
            CAPT_appSleep();
        } // end of else if(game_status == GAME_EXECUTING)
        else if(game_status == GAME_DISP_RESULT)
        {
#if 1
            strcpy(disp_buf, str_now);
#ifdef CCS_VER9
            ltoa(timer.min, tmp_buf);
#else
            ltoa(timer.min, tmp_buf, 10);
#endif
            strcat(disp_buf, tmp_buf);
            strcat(disp_buf, ":");
#ifdef CCS_VER9
            ltoa(timer.sec, tmp_buf);
#else
            ltoa(timer.sec, tmp_buf, 10);
#endif
            strcat(disp_buf, tmp_buf);
            strcat(disp_buf, ":");
#ifdef CCS_VER9
            ltoa(timer.msec, tmp_buf);
#else
            ltoa(timer.msec, tmp_buf, 10);
#endif
            strcat(disp_buf, tmp_buf);
            strcat(disp_buf, " ");

