ErnestCho/ccs_workspace_v12_msp_projects/msp430fr2676PTT_touch_timer_game/main_touch_timer_game_fr2676.c
            if(game_mode == GAME_MODE_TOUCH_TOUCH_RUN)
            {
                timer_comparison = timer.min*60*1000 + timer.sec*1000 + timer.msec;
                if((record_timer_comparison == 0) || (timer_comparison < record_timer_comparison) )  // new record condition
                {
                    record_timer.msec = timer.msec;
                    record_timer.sec = timer.sec;
                    record_timer.min = timer.min;
                    record_timer.hour = timer.hour;
                    record_timer_comparison = timer_comparison;

                    new_record_flag = 1;
                }
            }

            MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
            ssd1306_clearDisplay();
            if(game_mode == GAME_MODE_TOUCH_TOUCH_RUN)
            {
                if(new_record_flag == 1)
                {
                    ssd1306_printString(0, 0, str_new_record, FONT_MS_GOTHIC8x16);
                    new_record_flag = 0;
                }
                else
                {
                    ssd1306_printString(0, 0, str_result, FONT_MS_GOTHIC8x16);
                }
                ssd1306_printString(0, 3, disp_buf, FONT_MS_GOTHIC8x16);
            }
            else
            {
                ssd1306_printString(0, 0, str_result, FONT_MS_GOTHIC8x16);
                ssd1306_printString(0, 3, disp_buf, FONT_MS_GOTHIC8x16);
            }
            MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)

            if(game_mode == GAME_MODE_TOUCH_TOUCH_RUN)
            {
                strcpy(disp_buf, str_top);
#ifdef CCS_VER9
                ltoa(record_timer.min, tmp_buf);
#else
                ltoa(record_timer.min, tmp_buf, 10);
#endif
                strcat(disp_buf, tmp_buf);
                strcat(disp_buf, ":");
#ifdef CCS_VER9
                ltoa(record_timer.sec, tmp_buf);
#else
                ltoa(record_timer.sec, tmp_buf, 10);
#endif
                strcat(disp_buf, tmp_buf);
                strcat(disp_buf, ":");
#ifdef CCS_VER9
                ltoa(record_timer.msec, tmp_buf);
#else
                ltoa(record_timer.msec, tmp_buf, 10);
#endif
                strcat(disp_buf, tmp_buf);
                strcat(disp_buf, " ");

                MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
                ssd1306_printString(0, 5, disp_buf, FONT_MS_GOTHIC8x16);
                MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
            }
            else
            {
                strcpy(disp_buf, str_previous);
#ifdef CCS_VER9
                ltoa(previous_timer.min, tmp_buf);
#else
                ltoa(previous_timer.min, tmp_buf, 10);
#endif
                strcat(disp_buf, tmp_buf);
                strcat(disp_buf, ":");
#ifdef CCS_VER9
                ltoa(previous_timer.sec, tmp_buf);
#else
                ltoa(previous_timer.sec, tmp_buf, 10);
#endif
                strcat(disp_buf, tmp_buf);
                strcat(disp_buf, ":");
#ifdef CCS_VER9
                ltoa(previous_timer.msec, tmp_buf);
#else
                ltoa(previous_timer.msec, tmp_buf, 10);
#endif
                strcat(disp_buf, tmp_buf);
                strcat(disp_buf, " ");

                MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
                ssd1306_printString(0, 5, disp_buf, FONT_MS_GOTHIC8x16);
                MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)

                previous_timer.msec = timer.msec;
                previous_timer.sec = timer.sec;
                previous_timer.min = timer.min;
                previous_timer.hour = timer.hour;
            }

#endif

            game_status = GAME_WAIT_NEXT_STEP;
        }
        else if(game_status == GAME_WAIT_NEXT_STEP)
        {
            CAPT_appHandler();

            if( (touch_info.change_occur == 1) || (switch_status & BIT0) || (switch_status & BIT1) )
            {
                switch_status &= ~(BIT0 + BIT1);
                touch_info.change_occur = 0;

                if(touch_info.btn0_key_on == 1)
                {
                    game_status = GAME_SETTING;
                    game_repeat_cnt = game_repeat_cnt_backup;

                    if(game_mode == GAME_MODE_TOUCH_TOUCH_RUN)
                    {
                        game_mode = GAME_MODE_STOP_WATCH;
                    }
                    else
                    {
                        game_mode = GAME_MODE_TOUCH_TOUCH_RUN;
                    }

                    MAP_CAPT_disableISR(CAPT_TIMER_INTERRUPT);      // disable Captivate ISR during I2C OLED display writing. (to prevent text crack)
                    ssd1306_clearDisplay();
                    MAP_CAPT_enableISR(CAPT_TIMER_INTERRUPT);       // release disable Captivate ISR during I2C OLED display writing. (to prevent text crack)

                    switch_status = BIT0;
                }
            }

            //
            // End of background loop iteration
            // Go to sleep if there is nothing left to do
            //
            CAPT_appSleep();
        } // end of else if(game_status == GAME_DISP_RESULT)


    } // End of while
} // End main()

// Port 1 interrupt service routine
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void)
{
    // switch 1 detection ==> sw1 function : mode change
    if(SW1_PORT_IFG & SW1_BIT)
    {
        SW1_PORT_IFG &= ~SW1_BIT;                         // Clear PORT IFG for SW1

        if(switch_status == BIT1)   // do not operate if another switch pin is on operation
        {
            ;
        }
        else
        {
            switch_status |= BIT0;
        }
    }
    else
    {
        SW1_PORT_IFG &= ~SW1_BIT;
    }

