ErnestCho/ccs_workspace_v12_msp_projects/msp430fr2676PTT_touch_timer_game/main_touch_timer_game_fr2676.c
}
// Port 2 interrupt service routine
#pragma vector=PORT2_VECTOR
__interrupt void Port_2(void)
{

    // switch 2 detection ==> sw2 function : brightness control
    if(SW2_PORT_IFG & SW2_BIT)
    {
        SW2_PORT_IFG &= ~SW2_BIT;                         // Clear PORT IFG for SW1

        if(switch_status == BIT0)   // do not operate if another switch pin is on operation
        {
            ;
        }
        else
        {
            switch_status |= BIT1;
        }
    }
    else
    {
        SW2_PORT_IFG &= ~SW2_BIT;
    }

}


/******************************************************************************/
// Timer0_A0 Interrupt Service Routine: Disables the timer and exists LPM3
/******************************************************************************/


// 1ms continuous mode timer
#pragma vector=TIMER0_A0_VECTOR
__interrupt void ISR_Timer0_A0(void)
{
    TA0CCR0 += CONST_TIMER0_CCR0;               // Add Offset to CCR1

    timer.msec++;
    if(timer.msec >= LIMIT_MILI_SEC)
    {
        timer.msec = 0;
        timer.sec++;
        if(timer.sec >= LIMIT_SECOND)
        {
            timer.sec = 0;
            timer.min++;
            if(timer.min >= LIMIT_MINUTE)
            {
                timer.min = 0;
                timer.hour++;
            }
        }

    }
}


#pragma vector=TIMER0_A1_VECTOR
__interrupt void Timer0_A1A2(void)
{
    switch( TA0IV )
    {
        case  2:                                        // CCR1
        {
            TA0CCR1 += CONST_TIMER0_CCR1;               // Add Offset to CCR1

        }
        break;
        case  4:                                        // CCR2
        {
            TA0CCR2 += CONST_TIMER0_CCR2;               // Add Offset to CCR2

        } break;
        case 10:                                        // TA0 Overflow
        {
            //P1OUT ^= LED_TA0_OVF;
        } break;
    }
}


